### Infrastructure
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
github_repository.public["personal-infra"]: Refreshing state... [id=personal-infra]
github_repository.public["terraform-provider-googleplay"]: Refreshing state... [id=terraform-provider-googleplay]
github_repository.public["Cards"]: Refreshing state... [id=Cards]
github_repository.public["Conferences"]: Refreshing state... [id=Conferences]
github_repository.public["Website"]: Refreshing state... [id=Website]
github_repository.public["Choose"]: Refreshing state... [id=Choose]
github_repository.public["app-attest"]: Refreshing state... [id=app-attest]
github_repository.public["appstore-go"]: Refreshing state... [id=appstore-go]
github_repository.public["terraform-provider-appstore"]: Refreshing state... [id=terraform-provider-appstore]
github_repository.public["Capture"]: Refreshing state... [id=Capture]
github_repository.public["Versioning"]: Refreshing state... [id=Versioning]
github_repository.public["googleplay-go"]: Refreshing state... [id=googleplay-go]
github_repository.public["Crescendo"]: Refreshing state... [id=Crescendo]
googleplay_user.oliver: Refreshing state... [name=developers/5166846112789481453/users/mail@oliverbinns.info]
googleplay_user.example: Refreshing state... [name=developers/5166846112789481453/users/example@oliverbinns.info]
googleplay_user.service_account: Refreshing state... [name=developers/5166846112789481453/users/google-play-console@seraphic-elixir-305011.iam.gserviceaccount.com]
data.google_service_account.plan: Reading...
google_iam_workload_identity_pool.provider: Refreshing state... [id=projects/seraphic-elixir-305011/locations/global/workloadIdentityPools/terraform-provider-googleplay]
google_service_account.provider: Refreshing state... [id=projects/seraphic-elixir-305011/serviceAccounts/terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
data.google_organization.default: Reading...
data.google_service_account.plan: Read complete after 1s [id=projects/seraphic-elixir-305011/serviceAccounts/tf-plan@seraphic-elixir-305011.iam.gserviceaccount.com]
data.google_billing_account.default: Reading...
data.google_organization.default: Read complete after 1s [id=organizations/943988285976]
google_iam_workload_identity_pool_provider.provider: Refreshing state... [id=projects/seraphic-elixir-305011/locations/global/workloadIdentityPools/terraform-provider-googleplay/providers/github-actions]
googleplay_user.provider: Refreshing state... [name=developers/5166846112789481453/users/terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
google_service_account_iam_member.provider: Refreshing state... [id=projects/seraphic-elixir-305011/serviceAccounts/terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/411628404798/locations/global/workloadIdentityPools/terraform-provider-googleplay/attribute.repository/Oliver-Binns/terraform-provider-googleplay]
google_project_iam_member.provider["roles/iam.roleViewer"]: Refreshing state... [id=seraphic-elixir-305011/roles/iam.roleViewer/serviceAccount:terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
google_project_iam_member.provider["roles/iam.serviceAccountViewer"]: Refreshing state... [id=seraphic-elixir-305011/roles/iam.serviceAccountViewer/serviceAccount:terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
google_project_iam_member.provider["roles/iam.workloadIdentityPoolViewer"]: Refreshing state... [id=seraphic-elixir-305011/roles/iam.workloadIdentityPoolViewer/serviceAccount:terraform-provider-googleplay@seraphic-elixir-305011.iam.gserviceaccount.com]
data.google_billing_account.default: Read complete after 0s [id=016282-310295-698AE7]
google_project.wedding: Refreshing state... [id=projects/obinns-happily-ever-after]
github_branch_protection.public["Website"]: Refreshing state... [id=BPR_kwDOJFY4-M4CHjvY]
github_branch_protection.public["Conferences"]: Refreshing state... [id=BPR_kwDOIuMSZM4B9Yni]
github_branch_protection.public["terraform-provider-googleplay"]: Refreshing state... [id=BPR_kwDOODHYWs4DmTep]
github_branch_protection.public["Versioning"]: Refreshing state... [id=BPR_kwDOKqGNBc4CmKn9]
github_branch_protection.public["appstore-go"]: Refreshing state... [id=BPR_kwDOO2LLnM4Dyyfx]
github_branch_protection.public["googleplay-go"]: Refreshing state... [id=BPR_kwDOOGYaGs4DnFfB]
github_branch_protection.public["Capture"]: Refreshing state... [id=BPR_kwDOLQV1yM4Cyc3H]
github_branch_protection.public["Crescendo"]: Refreshing state... [id=BPR_kwDOK-nfKM4Dk1MS]
github_branch_protection.public["personal-infra"]: Refreshing state... [id=BPR_kwDOOepWKs4DxXSv]
github_branch_protection.public["Cards"]: Refreshing state... [id=BPR_kwDOGuN9tM4CTsSe]
github_branch_protection.public["app-attest"]: Refreshing state... [id=BPR_kwDONDwFa84DxYEC]
github_branch_protection.public["terraform-provider-appstore"]: Refreshing state... [id=BPR_kwDOPDAi4s4D2Pcj]
github_branch_protection.public["Choose"]: Refreshing state... [id=BPR_kwDOMJ5lf84DxYAM]
google_service_account.wedding_deploy: Refreshing state... [id=projects/obinns-happily-ever-after/serviceAccounts/firebase-deploy@obinns-happily-ever-after.iam.gserviceaccount.com]
google_iam_workload_identity_pool.wedding_deploy: Refreshing state... [id=projects/obinns-happily-ever-after/locations/global/workloadIdentityPools/firebase-deploy]
google_project_iam_member.wedding-plan: Refreshing state... [id=obinns-happily-ever-after/roles/serviceusage.serviceUsageConsumer/serviceAccount:tf-plan@seraphic-elixir-305011.iam.gserviceaccount.com]
google_firebase_web_app.basic: Refreshing state... [id=projects/obinns-happily-ever-after/webApps/1:253987264274:web:17942d505a815557d085cb]
google_firestore_database.database: Refreshing state... [id=projects/obinns-happily-ever-after/databases/rsvp]
google_firebase_apple_app.wedding: Refreshing state... [id=projects/obinns-happily-ever-after/iosApps/1:253987264274:ios:52faba6e979e57e2d085cb]
google_project_service.wedding["run.googleapis.com"]: Refreshing state... [id=obinns-happily-ever-after/run.googleapis.com]
google_project_service.wedding["artifactregistry.googleapis.com"]: Refreshing state... [id=obinns-happily-ever-after/artifactregistry.googleapis.com]
google_project_service.wedding["cloudbilling.googleapis.com"]: Refreshing state... [id=obinns-happily-ever-after/cloudbilling.googleapis.com]
google_project_service.wedding["firebase.googleapis.com"]: Refreshing state... [id=obinns-happily-ever-after/firebase.googleapis.com]
google_project_service.wedding["cloudbuild.googleapis.com"]: Refreshing state... [id=obinns-happily-ever-after/cloudbuild.googleapis.com]
google_project_service.wedding["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=obinns-happily-ever-after/cloudresourcemanager.googleapis.com]
google_project_service.wedding["serviceusage.googleapis.com"]: Refreshing state... [id=obinns-happily-ever-after/serviceusage.googleapis.com]
google_project_service.wedding["eventarc.googleapis.com"]: Refreshing state... [id=obinns-happily-ever-after/eventarc.googleapis.com]
google_project_service.wedding["firebaseextensions.googleapis.com"]: Refreshing state... [id=obinns-happily-ever-after/firebaseextensions.googleapis.com]
google_project_iam_member.wedding_deploy["roles/cloudbuild.builds.builder"]: Refreshing state... [id=obinns-happily-ever-after/roles/cloudbuild.builds.builder/serviceAccount:firebase-deploy@obinns-happily-ever-after.iam.gserviceaccount.com]
google_project_iam_member.wedding_deploy["roles/cloudfunctions.developer"]: Refreshing state... [id=obinns-happily-ever-after/roles/cloudfunctions.developer/serviceAccount:firebase-deploy@obinns-happily-ever-after.iam.gserviceaccount.com]
google_project_iam_member.wedding_deploy["roles/firebase.developAdmin"]: Refreshing state... [id=obinns-happily-ever-after/roles/firebase.developAdmin/serviceAccount:firebase-deploy@obinns-happily-ever-after.iam.gserviceaccount.com]
google_project_iam_member.wedding_deploy["roles/firebaseextensions.developer"]: Refreshing state... [id=obinns-happily-ever-after/roles/firebaseextensions.developer/serviceAccount:firebase-deploy@obinns-happily-ever-after.iam.gserviceaccount.com]
google_project_iam_member.wedding_deploy["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=obinns-happily-ever-after/roles/serviceusage.serviceUsageConsumer/serviceAccount:firebase-deploy@obinns-happily-ever-after.iam.gserviceaccount.com]
google_project_iam_member.wedding_deploy["roles/iam.serviceAccountUser"]: Refreshing state... [id=obinns-happily-ever-after/roles/iam.serviceAccountUser/serviceAccount:firebase-deploy@obinns-happily-ever-after.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.wedding_deploy: Refreshing state... [id=projects/obinns-happily-ever-after/locations/global/workloadIdentityPools/firebase-deploy/providers/github-actions]
google_service_account_iam_member.wedding_deploy: Refreshing state... [id=projects/obinns-happily-ever-after/serviceAccounts/firebase-deploy@obinns-happily-ever-after.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/253987264274/locations/global/workloadIdentityPools/firebase-deploy/subject/repo:Oliver-Binns/happily-ever-after:ref:refs/heads/main]
google_firebase_project.wedding: Refreshing state... [id=projects/obinns-happily-ever-after]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.public["googleplay-go"] will be updated in-place
  ~ resource "github_repository" "public" {
      ~ archived                    = true -> false
        id                          = "googleplay-go"
        name                        = "googleplay-go"
        # (37 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_iam_workload_identity_pool.wedding_googleplay_deploy will be created
  + resource "google_iam_workload_identity_pool" "wedding_googleplay_deploy" {
      + description               = "Pool to deploy apps to Google Play"
      + disabled                  = false
      + display_name              = "Google Play Deploy"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "obinns-happily-ever-after"
      + state                     = (known after apply)
      + workload_identity_pool_id = "googleplay-deploy"
    }

  # google_iam_workload_identity_pool_provider.wedding_googleplay_deploy will be created
  + resource "google_iam_workload_identity_pool_provider" "wedding_googleplay_deploy" {
      + attribute_condition                = <<-EOT
            google.subject == 'repo:Oliver-Binns/happily-ever-after:ref:refs/heads/main'
            && attribute.org == "Oliver-Binns"
            && attribute.repository == "Oliver-Binns/happily-ever-after"
        EOT
      + attribute_mapping                  = {
          + "attribute.org"        = "assertion.repository_owner"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "OIDC identity pool provider for Google Play Deploys in GitHub Actions"
      + display_name                       = "GitHub Actions"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "obinns-happily-ever-after"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "googleplay-deploy"
      + workload_identity_pool_provider_id = "github-actions"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # google_service_account.wedding_googleplay_deploy will be created
  + resource "google_service_account" "wedding_googleplay_deploy" {
      + account_id   = "googleplay-deploy"
      + disabled     = false
      + display_name = "Google Play Deploy"
      + email        = "googleplay-deploy@obinns-happily-ever-after.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:googleplay-deploy@obinns-happily-ever-after.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "obinns-happily-ever-after"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.wedding_googleplay_deploy will be created
  + resource "google_service_account_iam_member" "wedding_googleplay_deploy" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # googleplay_app_iam.wedding_googleplay_deploy will be created
  + resource "googleplay_app_iam" "wedding_googleplay_deploy" {
      + app_id               = "4975313787980303395"
      + expanded_permissions = (known after apply)
      + permissions          = [
          + "CAN_MANAGE_PRODUCTION_RELEASES",
        ]
      + user_id              = "googleplay-deploy@obinns-happily-ever-after.iam.gserviceaccount.com"
    }

  # googleplay_user.wedding_googleplay_deploy will be created
  + resource "googleplay_user" "wedding_googleplay_deploy" {
      + email                = "googleplay-deploy@obinns-happily-ever-after.iam.gserviceaccount.com"
      + expanded_permissions = (known after apply)
      + global_permissions   = [
          + "CAN_VIEW_APP_QUALITY_GLOBAL",
        ]
      + name                 = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Copilot, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Infrastructure Updates`*